docs/notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-11-19 Sat 18:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Alexander Brown" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href=" ./style.css" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#knowledge-base">1. Knowledge Base</a></li>
<li><a href="#control-theory">2. Control Theory</a></li>
<li><a href="#estimation">3. Estimation</a>
<ul>
<li><a href="#optimal-estimation">3.1. Optimal Estimation</a></li>
</ul>
</li>
<li><a href="#mathematics">4. Mathematics</a>
<ul>
<li><a href="#calculus">4.1. Calculus</a></li>
<li><a href="#fuzzy-logic">4.2. Fuzzy Logic</a></li>
<li><a href="#linear-algebra">4.3. Linear Algebra</a>
<ul>
<li><a href="#vectors">4.3.1. Vectors</a></li>
</ul>
</li>
<li><a href="#set-theory">4.4. Set Theory</a></li>
<li><a href="#quaternions">4.5. Quaternions</a></li>
<li><a href="#queue-theory">4.6. Queue Theory</a></li>
</ul>
</li>
<li><a href="#optimization">5. Optimization</a>
<ul>
<li><a href="#parametric-programming">5.1. Parametric Programming</a></li>
<li><a href="#linear-programming">5.2. Linear Programming</a>
<ul>
<li><a href="#fuzzy-linear-programming">5.2.1. Fuzzy Linear Programming</a></li>
<li><a href="#stochastic-programmming">5.2.2. Stochastic Programmming</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#programming">6. Programming</a>
<ul>
<li><a href="#matlab">6.1. MATLAB</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-knowledge-base" class="outline-2">
<h2 id="knowledge-base"><span class="section-number-2">1.</span> Knowledge Base</h2>
<div class="outline-text-2" id="text-knowledge-base">
<p>
This page is somewhat misleading. I provide links to general starting points, but the idea is to have a free-flowing set
of knowledge that can be interconnected with one another. The idea is to separate yourself from the idea of categorizing
topics in your head and effectively building mental barriers between these ideas. To reiterate, the links before only
provide general starting points for what you may be interested in finding.
</p>
</div>
</div>

<div id="outline-container-control-theory" class="outline-2">
<h2 id="control-theory"><span class="section-number-2">2.</span> Control Theory</h2>
<div class="outline-text-2" id="text-control-theory">
<ul class="org-ul">
<li><a href="nonlinear_control.html">Nonlinear Control</a></li>
</ul>
</div>
</div>

<div id="outline-container-estimation" class="outline-2">
<h2 id="estimation"><span class="section-number-2">3.</span> Estimation</h2>
<div class="outline-text-2" id="text-estimation">
<p>
<a href="estimation.html">Estimation</a> is the process of attempting to derive the true value of measurements taken from a system that are subect to
noise and/or bias.
</p>
</div>

<div id="outline-container-optimal-estimation" class="outline-3">
<h3 id="optimal-estimation"><span class="section-number-3">3.1.</span> Optimal Estimation</h3>
<div class="outline-text-3" id="text-optimal-estimation">
<p>
<a href="optimal_estimation.html">Optimal Estimation</a>, much like estimation, attempts to estimate the true value from a measurement that has been subject
to noise and bias. This optimization method is known as the <a href="kalman_filter.html">Kalman Filter</a>.
</p>
</div>
</div>
</div>

<div id="outline-container-mathematics" class="outline-2">
<h2 id="mathematics"><span class="section-number-2">4.</span> Mathematics</h2>
<div class="outline-text-2" id="text-mathematics">
</div>
<div id="outline-container-calculus" class="outline-3">
<h3 id="calculus"><span class="section-number-3">4.1.</span> Calculus</h3>
<div class="outline-text-3" id="text-calculus">
<ul class="org-ul">
<li><a href="derivatives.html">Derivatives</a></li>
</ul>
</div>
</div>

<div id="outline-container-fuzzy-logic" class="outline-3">
<h3 id="fuzzy-logic"><span class="section-number-3">4.2.</span> Fuzzy Logic</h3>
<div class="outline-text-3" id="text-fuzzy-logic">
<ul class="org-ul">
<li><a href="fuzzy_theory.html">Fuzzy Logic</a></li>
</ul>
</div>
</div>

<div id="outline-container-linear-algebra" class="outline-3">
<h3 id="linear-algebra"><span class="section-number-3">4.3.</span> Linear Algebra</h3>
<div class="outline-text-3" id="text-linear-algebra">
<p>
<a href="linear_algebra.html">Linear algebra</a> is the branch of mathematics concerning linear equations and their representation in vector spaces and
through matrices.
</p>
</div>

<div id="outline-container-vectors" class="outline-4">
<h4 id="vectors"><span class="section-number-4">4.3.1.</span> Vectors</h4>
<div class="outline-text-4" id="text-vectors">
<p>
<a href="vectors.html">Vectors</a>
</p>
</div>
</div>
</div>

<div id="outline-container-set-theory" class="outline-3">
<h3 id="set-theory"><span class="section-number-3">4.4.</span> Set Theory</h3>
<div class="outline-text-3" id="text-set-theory">
<p>
The theory of <a href="set_theory.html">sets</a> in a nutshell.
</p>
</div>
</div>

<div id="outline-container-quaternions" class="outline-3">
<h3 id="quaternions"><span class="section-number-3">4.5.</span> Quaternions</h3>
<div class="outline-text-3" id="text-quaternions">
<p>
Theory of <a href="quaternion_theory.html">quaternions</a> in a nutshell
</p>
</div>
</div>

<div id="outline-container-queue-theory" class="outline-3">
<h3 id="queue-theory"><span class="section-number-3">4.6.</span> Queue Theory</h3>
<div class="outline-text-3" id="text-queue-theory">
<p>
<a href="queueing_theory.html">Queueing Theory</a>
</p>
</div>
</div>
</div>

<div id="outline-container-optimization" class="outline-2">
<h2 id="optimization"><span class="section-number-2">5.</span> Optimization</h2>
<div class="outline-text-2" id="text-optimization">
<p>
Below are some sections on optimization types. <a href="optimization_for_engineers_class.html">This link has a set of notes from optimization for engineers</a>.
</p>
</div>

<div id="outline-container-parametric-programming" class="outline-3">
<h3 id="parametric-programming"><span class="section-number-3">5.1.</span> Parametric Programming</h3>
<div class="outline-text-3" id="text-parametric-programming">
<p>
Parametric programming is a type of optimization, where the optimization problem is solved as a function of one or
multiple parameters.
</p>
</div>
</div>

<div id="outline-container-linear-programming" class="outline-3">
<h3 id="linear-programming"><span class="section-number-3">5.2.</span> Linear Programming</h3>
<div class="outline-text-3" id="text-linear-programming">
<p>
Process of optimization by setting up the world's largest set of linear equations
</p>
</div>

<div id="outline-container-fuzzy-linear-programming" class="outline-4">
<h4 id="fuzzy-linear-programming"><span class="section-number-4">5.2.1.</span> Fuzzy Linear Programming</h4>
<div class="outline-text-4" id="text-fuzzy-linear-programming">
<p>
<a href="fuzzy_lin_prog.html">Fuzzy Linear Programming</a>
</p>
</div>
</div>

<div id="outline-container-stochastic-programmming" class="outline-4">
<h4 id="stochastic-programmming"><span class="section-number-4">5.2.2.</span> Stochastic Programmming</h4>
<div class="outline-text-4" id="text-stochastic-programmming">
<p>
<a href="stochastic_prog.html">Stochastic Programming</a> is a framework for modeling optimizaiton problems that involve uncertainty. A stochastic program
is an optimization problem in which som eor all problem parameters are uncertain, but follow known probability
distributions.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-programming" class="outline-2">
<h2 id="programming"><span class="section-number-2">6.</span> Programming</h2>
<div class="outline-text-2" id="text-programming">
</div>

<div id="outline-container-matlab" class="outline-3">
<h3 id="matlab"><span class="section-number-3">6.1.</span> MATLAB</h3>
<div class="outline-text-3" id="text-matlab">
<p>
MATLAB is sorta butts, but here are some useful <a href="matlab_tips.html">tips</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Alexander Brown</p>
<p class="date">Created: 2022-11-19 Sat 18:47</p>
</div>
</body>
</html>
